<script setup lang="ts">
definePageMeta({
  title: 'حریم خصوصی',
  preview: {
    title: 'ذهنا',
    description: 'سیاست های استفاده از داده و حریم خصوصی سامانه ذهنا.',
    categories: ['dashboards'],
    src: '/img/screens/dashboards-writer.png',
    srcDark: '/img/screens/dashboards-writer-dark.png',
    order: 18,
  },
})
useHead({ htmlAttrs: { dir: 'rtl' } })
const accordion = ref([{
    title: "مقدمه",
    content: 'در "ذهنا"، ما به حریم خصوصی شما اهمیت می‌دهیم و متعهد به حفظ امنیت اطلاعات شخصی‌ای هستیم که شما به ما اعتماد می‌کنید. این سیاست حریم خصوصی توضیح می‌دهد چگونه اطلاعات شخصی شما را جمع‌آوری، استفاده، محافظت و اشتراک‌گذاری می‌کنیم.'
},
{
    title: "جمع‌آوری اطلاعات",
    content: '"ذهنا" اطلاعاتی را جمع‌آوری می‌کند که شما به صورت داوطلبانه ارائه می‌دهید، از جمله نام، آدرس ایمیل، سن، جنسیت و سایر اطلاعات مرتبط با سلامت روان که در جریان استفاده از خدمات ما ارائه می‌دهید. همچنین، ما ممکن است اطلاعاتی را به صورت خودکار از دستگاه شما جمع‌آوری کنیم، از جمله آدرس IP، نوع مرورگر، سیستم عامل و سایر اطلاعات فنی.'
},
{
    title: "استفاده از اطلاعات",
    content: 'اطلاعات جمع‌آوری شده برای ارائه و بهبود خدمات، پاسخ به درخواست‌ها، ارتباط با کاربران، تحلیل استفاده از سامانه و برای اهداف امنیتی و قانونی استفاده می‌شود.'
},
{
    title: "حفاظت از اطلاعات",
    content: '"ذهنا" از تدابیر امنیتی فنی و سازمانی برای محافظت از اطلاعات شخصی شما در برابر دسترسی‌های غیرمجاز، افشای ناخواسته، تغییر، تخریب یا از بین رفتن غیرقانونی استفاده می‌کند.'
},
{
    title: "اشتراک‌گذاری اطلاعات",
    content: '"ذهنا" بدون رضایت صریح شما، اطلاعات شخصی ش ما را با طرف‌های ثالث به اشتراک نمی‌گذارد، مگر در مواردی که برای ارائه خدمات شما ضروری باشد، یا در صورتی که توسط قانون مجاز باشد یا به موجب حکم دادگاه ملزم به انجام آن باشیم. همچنین، ممکن است اطلاعات را در صورتی که فعالیت‌های غیرقانونی یا تخلف از قوانین استفاده ما مشاهده شود، یا برای حفاظت از حقوق، مالکیت یا امنیت "ذهنا" و کاربرانش، با مقامات قانونی به اشتراک بگذاریم.'
},
{
    title: "دسترسی و اصلاح اطلاعات",
    content: 'شما حق دارید تا اطلاعات شخصی خود را که در اختیار "ذهنا" قرار داده‌اید، مشاهده، اصلاح یا حذف کنید. برای این منظور، می‌توانید با استفاده از امکانات موجود در سامانه یا با ارسال درخواست به ایمیل پشتیبانی ما اقدام نمایید.'
},
{
    title: "استفاده از کوکی‌ها و فناوری‌های مشابه",
    content: '"ذهنا" ممکن است از کوکی‌ها و فناوری‌های مشابه برای بهبود تجربه کاربری و جمع‌آوری اطلاعات آماری درباره استفاده از سامانه استفاده کند. شما می‌توانید مرورگر خود را تنظیم کنید تا کوکی‌ها را رد کند یا قبل از قبول کوکی از شما اجازه بخواهد.'
},
{
    title: "تغییرات در سیاست حریم خصوصی",
    content: '"ذهنا" ممکن است این سیاست حریم خصوصی را برای بازتاب دادن تغییرات در خدمات یا قوانین مربوطه به‌روزرسانی کند. ما کاربران را از طریق سامانه یا ایمیل از هرگونه تغییرات قابل توجه مطلع خواهیم کرد. استفاده ادامه‌دار شما از خدمات پس از اعمال این تغییرات به منزله پذیرش آنها است.'
},
{
    title: "تماس با ما",
    content: 'اگر سوالاتی در مورد این سیاست حریم خصوصی دارید، نحوه جمع‌آوری و استفاده از اطلاعات شخصی شما، یا می‌خواهید حقوق خود را در مورد اطلاعاتتان اعمال کنید، لطفاً با ما از طریق ایمیل [ایمیل پشتیبانی] یا تلفن [شماره تلفن پشتیبانی] تماس بگیرید. تیم پشتیبانی "ذهنا" آماده پاسخگویی به پرسش‌ها و نگرانی‌های شما در اسرع وقت است.'
},
{
    title: "تأیید و رضایت",
    content: 'با استفاده از سامانه "ذهنا"، شما تأیید می‌کنید که این سیاست حریم خصوصی را مطالعه کرده‌اید و به جمع‌آوری، استفاده و اشتراک‌گذاری اطلاعات شخصی خود طبق شرایط ذکر شده در این سیاست رضایت می‌دهید.'
}
])
</script>

<template>
  <div class="relative">
    <!-- Grid -->
    <div class="grid grid-cols-12 gap-6">
      <!-- Column -->
      <div class="col-span-12 m-7">
        <!-- Inner grid -->
        <div class="grid grid-cols-12 gap-6">
          <!-- Header -->
          <div class="col-span-12">
            <div
              class="bg-primary-800 flex flex-col items-center rounded-2xl p-4 sm:flex-row"
            >
              <div class="relative h-[150px] w-[320px] shrink-0 sm:h-[175px]">
                <img
                  class="pointer-events-none absolute start-6 top-0 sm:-start-10"
                  src="/img/illustrations/dashboards/writer/readers.svg"
                  alt="Readers illustration"
                />
              </div>
              <div class="mt-6 grow sm:mt-0">
                <div class="pb-4 text-center sm:pb-0 sm:text-right">
                  <BaseHeading tag="h1" class="text-white opacity-90">
                    <span>سیاست حریم خصوصی سامانه همدلی هوشمند "ذهنا"</span>
                  </BaseHeading>
                  <BaseParagraph
                    class=" text-white opacity-70"
                  >
                    <span>
                      استفاده از سیستم ذهنا،‌ به منزله ی پذیرش این سیاست ها می
                      باشد.
                    </span>
                  </BaseParagraph>
                  <!-- <div class="mt-2">
                    <BaseButton
                      size="sm"
                      color="light"
                      flavor="outline"
                      class="w-full sm:w-auto"
                    >
                      <Icon name="lucide:plus" class="h-4 w-4" />
                      <span>New Article</span>
                    </BaseButton>
                  </div> -->
                </div>
              </div>
            </div>
          </div>
          <!-- Content -->
          <div class="col-span-12">
            <!-- Sub grid -->
            <div class="grid grid-cols-12 gap-6">
              <!-- Sub column -->
              <div class="col-span-12">
                <!-- Widget -->
                <BaseCard class="p-6" shape="curved">
                  <!-- Title -->
                  <div class="mb-8 flex items-center justify-between">
                    <BaseHeading
                      as="h3"
                      size="md"
                      weight="semibold"
                      lead="tight"
                      class="text-muted-800 dark:text-white"
                    >
                      <span>سیاست های حریم خصوصی و به اشتراک گذاری اطلاعات </span>
                    </BaseHeading>
                  </div>
                    <div class="text-muted-900 dark:text-white text-right mb-7">
                      در ادامه مجموعه ی سیاست های حریم خصوصی و اشتراک گذاری اطلاعات قرار دارد. استفاده از سامانه به منزله‌ی پذیرش این سیاست هاست.
                    </div>
                    <div class="w-[100%]">
    <BaseAccordion :items="accordion"  />
  </div>
                </BaseCard>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
