<script setup lang="ts">
definePageMeta({
  title: 'قوانین استفاده',
  preview: {
    title: 'ذهنا',
    description: 'قوانین و مقررات سامانه برای استفاده.',
    categories: ['dashboards'],
    src: '/img/screens/dashboards-writer.png',
    srcDark: '/img/screens/dashboards-writer-dark.png',
    order: 18,
  },
})
useHead({ htmlAttrs: { dir: 'rtl' } })
const accordion = ref([{
    title: "مقدمه",
    content: '"ذهنا" یک سامانه همدلی هوشمند است که با استفاده از فناوری‌های پیشرفته در زمینه هوش مصنوعی، خدمات مشاوره و پشتیبانی سلامت روان را ارائه می‌دهد. استفاده از این سامانه به معنای پذیرش قوانین و شرایط استفاده از خدمات ما است.'
},
{
    title: "مسئولیت کاربر",
    content: 'کاربران موظفند اطلاعات صحیح و دقیقی را در اختیار سامانه قرار دهند. توصیه‌ها و پیشنهادات ارائه شده توسط "ذهنا" بر اساس اطلاعات وارد شده توسط کاربران صورت می‌پذیرد. کاربران باید آگاه باشند که استفاده از این پیشنهادات به عهده خود آنها است و "ذهنا" هیچ مسئولیتی در قبال نتایج حاصل از اجرای این پیشنهادات ندارد.'
},
{
    title: "محدودیت‌های هوش مصنوعی",
    content: 'هرچند "ذهنا" از تکنولوژی‌های پیشرفته هوش مصنوعی استفاده می‌کند، اما باید توجه داشت که هوش مصنوعی نمی‌تواند جایگزین مشاوره حضوری با متخصصین سلامت روان شود. هوش مصنوعی ممکن است در برخی موارد نتواند تشخیص‌های دقیق ارائه دهد و یا پیشنهاداتی که می‌دهد ممکن است برای همه افراد مناسب نباشد.'
},
{
    title: "حقوق معنوی و حریم خصوصی",
    content: '"ذهنا" متعهد به حفظ حریم خصوصی کاربران ورعایت قوانین مربوط به حقوق معنوی و داده‌های شخصی است. تمام اطلاعات جمع‌آوری شده از کاربران، اعم از اطلاعات شخصی و داده‌های استفاده از خدمات، تحت حفاظت و در راستای ارائه و بهبود خدمات "ذهنا" مورد استفاده قرار خواهند گرفت. اطلاعات شخصی کاربران بدون رضایت آن‌ها به هیچ طرف ثالثی افشا نخواهد شد، مگر در مواردی که بر اساس قانون مجاز باشد.'
},
{
    title: "محدودیت استفاده",
    content: 'کاربران می‌پذیرند که از خدمات "ذهنا" تنها برای مقاصد قانونی و اخلاقی استفاده کنند. هرگونه استفاده سوء از خدمات، اعم از تلاش برای فریب سیستم، ورود غیرمجاز به بخش‌های امنیتی سامانه، یا ارسال اطلاعات مضر و مخرب، ممنوع است و می‌تواند منجر به مسدودسازی دسترسی کاربر و اقدامات قانونی علیه وی شود.'
},
{
    title: "تغییرات در قوانین استفاده",
    content: '"ذهنا" حق دارد در هر زمان قوانین استفاده از سامانه را به‌روزرسانی یا تغییر دهد. کاربران موظفند به‌طور منظم این قوانین را مرور کرده و از تغییرات احتمالی آگاه شوند. استفاده ادامه‌دار از سامانه پس از اعمال تغییرات به منزله پذیرش آن تغییرات تلقی می‌شود.'
},
{
    title: "انکار مسئولیت",
    content: '"ذهنا" تلاش می‌کند تا خدماتی دقیق و به‌روز ارائه دهد، اما نمی‌تواند تضمین کند که خدمات همیشه بدون نقص، اختلال یا خطا خواهند بود. "ذهنا" هیچ مسئولیتی در قبال خسارات مستقیم، غیرمستقیم، تصادفی، خاص یا ناشی از استفاده یا عدم امکان استفاده از خدمات نخواهد داشت.'
},
{
    title: "قانون حاکم و صلاحیت دادگاه",
    content: 'قوانین استفاده از "ذهنا" و هرگونه اختلاف ناشی از آن تحت قوانین کشور میزبان سامانه و اصول حقوق بین‌الملل تفسیر و اجرا خواهد شد. در صورت بروز اختلاف، طرفین تلاش می‌کنند تا از طریق مذاکره و میانجیگری به حل و فصل دست یابند. در صورت عدم امکان حل اختلاف از این طریق، موضوع به دادگاه‌های صالح در کشور میزبان ارجاع داده می‌شود تا بر اساس قوانین آن کشور به آن رسیدگی شود.'
},
{
    title: "تماس و پشتیبانی",
    content: 'برای هرگونه سوال، نگرانی یا نیاز به پشتیبانی، کاربران می‌توانند از طریق ایمیل، شماره تماس یا بخش پشتیبانی در وب‌سایت "ذهنا" با ما در ارتباط باشند. تیم ما متعهد به ارائه پاسخ به موقع و حمایت از کاربران در بهترین شکل ممکن است.'
},
{
    title: "پذیرش قوانین استفاده",
    content: 'با استفاده از خدمات "ذهنا"، کاربران تأیید می‌کنند که این قوانین استفاده را خوانده‌اند، درک کرده‌اند و با آن‌ها موافقت نموده‌اند. استفاده از خدمات "ذهنا" بدون پذیرش این شرایط مجاز نیست.'
}
])
</script>

<template>
  <div class="relative">
    <!-- Grid -->
    <div class="grid grid-cols-12 gap-6">
      <!-- Column -->
      <div class="col-span-12 m-7">
        <!-- Inner grid -->
        <div class="grid grid-cols-12 gap-6">
          <!-- Header -->
          <div class="col-span-12">
            <div
              class="bg-primary-800 flex flex-col items-center rounded-2xl p-4 sm:flex-row"
            >
              <div class="relative h-[150px] w-[320px] shrink-0 sm:h-[175px]">
                <img
                  class="pointer-events-none absolute start-6 top-0 sm:-start-10"
                  src="/img/illustrations/dashboards/writer/readers.svg"
                  alt="Readers illustration"
                />
              </div>
              <div class="mt-6 grow sm:mt-0">
                <div class="pb-4 text-center sm:pb-0 sm:text-right">
                  <BaseHeading tag="h1" class="text-white opacity-90">
                    <span>قوانین و مقررات استفاده</span>
                  </BaseHeading>
                  <BaseParagraph
                    class=" text-white opacity-70"
                  >
                    <span>
                      استفاده از سیستم ذهنا،‌ به منزله ی پذیرش قوانین استفاده می
                      باشد.
                    </span>
                  </BaseParagraph>
                  <!-- <div class="mt-2">
                    <BaseButton
                      size="sm"
                      color="light"
                      flavor="outline"
                      class="w-full sm:w-auto"
                    >
                      <Icon name="lucide:plus" class="h-4 w-4" />
                      <span>New Article</span>
                    </BaseButton>
                  </div> -->
                </div>
              </div>
            </div>
          </div>
          <!-- Content -->
          <div class="col-span-12">
            <!-- Sub grid -->
            <div class="grid grid-cols-12 gap-6">
              <!-- Sub column -->
              <div class="col-span-12">
                <!-- Widget -->
                <BaseCard class="p-6" shape="curved">
                  <!-- Title -->
                  <div class="mb-8 flex items-center justify-between">
                    <BaseHeading
                      as="h3"
                      size="md"
                      weight="semibold"
                      lead="tight"
                      class="text-muted-800 dark:text-white"
                    >
                      <span>قوانین استفاده</span>
                    </BaseHeading>
                  </div>
                    <div class="text-muted-900 dark:text-white text-right mb-7">
                      در زیر قوانین استفاده از سامانه ذهنا آورده شده است. تمام این قوانین لازم الاجرا و مهم می باشند.
                    </div>
                    <div class="w-[100%]">
    <BaseAccordion :items="accordion"  />
  </div>
                </BaseCard>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
